espressif/esp-idf/components/soc/esp32c61/register/soc/ahb_dma_reg.h
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_REG register
 *  TX channel 0 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_REG (DR_REG_AHB_DMA_BASE + 0x2e0)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight optimization for TX channel 0.
 *  0: Enable
 *  1: Disable
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH0_S  0

/** AHB_DMA_TX_CH_ARB_WEIGHT_CH1_REG register
 *  TX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x304)
/** AHB_DMA_TX_CH_ARB_WEIGHT_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight (i.e. the number of tokens) of TX channel1.
 *  Value range: 0 ~ 15.
 */
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1    0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1_M  (AHB_DMA_TX_CH_ARB_WEIGHT_CH1_V << AHB_DMA_TX_CH_ARB_WEIGHT_CH1_S)
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1_V  0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGHT_CH1_S  0

/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_REG register
 *  TX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_REG (DR_REG_AHB_DMA_BASE + 0x308)
/** AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight optimization for TX channel 1.
 *  0: Enable
 *  1: Disable
 */
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_M  (AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_V << AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_S)
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGHT_OPT_DIS_CH1_S  0

/** AHB_DMA_RX_CH_ARB_WEIGHT_CH0_REG register
 *  RX channel 0 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0_REG (DR_REG_AHB_DMA_BASE + 0x354)
/** AHB_DMA_RX_CH_ARB_WEIGHT_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight (i.e. the number of tokens) of RX channel0.
 *  Value range: 0 ~ 15.
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0    0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0_M  (AHB_DMA_RX_CH_ARB_WEIGHT_CH0_V << AHB_DMA_RX_CH_ARB_WEIGHT_CH0_S)
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0_V  0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH0_S  0

/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_REG register
 *  RX channel 0 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_REG (DR_REG_AHB_DMA_BASE + 0x358)
/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight optimization for RX channel 0.
 *  0: Enable
 *  1: Disable
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_M  (AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_V << AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_S)
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH0_S  0

/** AHB_DMA_RX_CH_ARB_WEIGHT_CH1_REG register
 *  RX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1_REG (DR_REG_AHB_DMA_BASE + 0x37c)
/** AHB_DMA_RX_CH_ARB_WEIGHT_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight (i.e. the number of tokens) of RX channel1.
 *  Value range: 0 ~ 15.
 */
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1    0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1_M  (AHB_DMA_RX_CH_ARB_WEIGHT_CH1_V << AHB_DMA_RX_CH_ARB_WEIGHT_CH1_S)
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1_V  0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGHT_CH1_S  0

/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_REG register
 *  RX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_REG (DR_REG_AHB_DMA_BASE + 0x380)
/** AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight optimization for RX channel 1.
 *  0: Enable
 *  1: Disable
 */
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_M  (AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V << AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S)
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGHT_OPT_DIS_CH1_S  0

/** AHB_DMA_IN_LINK_ADDR_CH0_REG register
 *  Linked list descriptor configuration register of RX channel 0
 */
#define AHB_DMA_IN_LINK_ADDR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x3ac)
/** AHB_DMA_INLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  Represents the first receive descriptor's address.
 */
#define AHB_DMA_INLINK_ADDR_CH0    0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH0_M  (AHB_DMA_INLINK_ADDR_CH0_V << AHB_DMA_INLINK_ADDR_CH0_S)
#define AHB_DMA_INLINK_ADDR_CH0_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH0_S  0

/** AHB_DMA_IN_LINK_ADDR_CH1_REG register
 *  Linked list descriptor configuration register of RX channel 1
 */
#define AHB_DMA_IN_LINK_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x3b0)
/** AHB_DMA_INLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  Represents the first receive descriptor's address.
 */
#define AHB_DMA_INLINK_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH1_M  (AHB_DMA_INLINK_ADDR_CH1_V << AHB_DMA_INLINK_ADDR_CH1_S)
#define AHB_DMA_INLINK_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH1_S  0

/** AHB_DMA_OUT_LINK_ADDR_CH0_REG register
 *  Linked list descriptor configuration register of TX channel 0
 */
#define AHB_DMA_OUT_LINK_ADDR_CH0_REG (DR_REG_AHB_DMA_BASE + 0x3b8)
/** AHB_DMA_OUTLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  Represents the first transmit descriptor's address.
 */
#define AHB_DMA_OUTLINK_ADDR_CH0    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH0_M  (AHB_DMA_OUTLINK_ADDR_CH0_V << AHB_DMA_OUTLINK_ADDR_CH0_S)
#define AHB_DMA_OUTLINK_ADDR_CH0_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH0_S  0

/** AHB_DMA_OUT_LINK_ADDR_CH1_REG register
 *  Linked list descriptor configuration register of TX channel 1
 */
#define AHB_DMA_OUT_LINK_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x3bc)
/** AHB_DMA_OUTLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  Represents the first transmit descriptor's address.
 */
#define AHB_DMA_OUTLINK_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH1_M  (AHB_DMA_OUTLINK_ADDR_CH1_V << AHB_DMA_OUTLINK_ADDR_CH1_S)
#define AHB_DMA_OUTLINK_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH1_S  0

/** AHB_DMA_INTR_MEM_START_ADDR_REG register
 *  Accessible address space start address configuration register
 */
#define AHB_DMA_INTR_MEM_START_ADDR_REG (DR_REG_AHB_DMA_BASE + 0x3c4)
/** AHB_DMA_ACCESS_INTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of accessible address space.
 */
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR    0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_M  (AHB_DMA_ACCESS_INTR_MEM_START_ADDR_V << AHB_DMA_ACCESS_INTR_MEM_START_ADDR_S)
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_S  0

/** AHB_DMA_INTR_MEM_END_ADDR_REG register
 *  Accessible address space end address configuration register
 */
#define AHB_DMA_INTR_MEM_END_ADDR_REG (DR_REG_AHB_DMA_BASE + 0x3c8)
/** AHB_DMA_ACCESS_INTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of accessible address space.
 */
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR    0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_M  (AHB_DMA_ACCESS_INTR_MEM_END_ADDR_V << AHB_DMA_ACCESS_INTR_MEM_END_ADDR_S)
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_S  0

/** AHB_DMA_ARB_TIMEOUT_TX_REG register
 *  Reserved
 */
#define AHB_DMA_ARB_TIMEOUT_TX_REG (DR_REG_AHB_DMA_BASE + 0x3cc)
/** AHB_DMA_ARB_TIMEOUT_TX : R/W; bitpos: [15:0]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_ARB_TIMEOUT_TX    0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_TX_M  (AHB_DMA_ARB_TIMEOUT_TX_V << AHB_DMA_ARB_TIMEOUT_TX_S)
#define AHB_DMA_ARB_TIMEOUT_TX_V  0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_TX_S  0

/** AHB_DMA_ARB_TIMEOUT_RX_REG register
 *  Reserved
 */
#define AHB_DMA_ARB_TIMEOUT_RX_REG (DR_REG_AHB_DMA_BASE + 0x3d0)
/** AHB_DMA_ARB_TIMEOUT_RX : R/W; bitpos: [15:0]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_ARB_TIMEOUT_RX    0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_RX_M  (AHB_DMA_ARB_TIMEOUT_RX_V << AHB_DMA_ARB_TIMEOUT_RX_S)
#define AHB_DMA_ARB_TIMEOUT_RX_V  0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_RX_S  0

