espressif/esp-idf/components/soc/esp32c61/register/soc/ahb_dma_reg.h
/** AHB_DMA_WEIGHT_EN_TX_REG register
 *  Reserved
 */
#define AHB_DMA_WEIGHT_EN_TX_REG (DR_REG_AHB_DMA_BASE + 0x3d4)
/** AHB_DMA_WEIGHT_EN_TX : R/W; bitpos: [0]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_WEIGHT_EN_TX    (BIT(0))
#define AHB_DMA_WEIGHT_EN_TX_M  (AHB_DMA_WEIGHT_EN_TX_V << AHB_DMA_WEIGHT_EN_TX_S)
#define AHB_DMA_WEIGHT_EN_TX_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_TX_S  0

/** AHB_DMA_WEIGHT_EN_RX_REG register
 *  Reserved
 */
#define AHB_DMA_WEIGHT_EN_RX_REG (DR_REG_AHB_DMA_BASE + 0x3d8)
/** AHB_DMA_WEIGHT_EN_RX : R/W; bitpos: [0]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_WEIGHT_EN_RX    (BIT(0))
#define AHB_DMA_WEIGHT_EN_RX_M  (AHB_DMA_WEIGHT_EN_RX_V << AHB_DMA_WEIGHT_EN_RX_S)
#define AHB_DMA_WEIGHT_EN_RX_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_RX_S  0

/** AHB_DMA_ARB_TIMEOUT_REG register
 *  Weight arbitration timeout configuration register
 */
#define AHB_DMA_ARB_TIMEOUT_REG (DR_REG_AHB_DMA_BASE + 0x3dc)
/** AHB_DMA_ARB_TIMEOUT : R/W; bitpos: [15:0]; default: 0;
 *  Configures the time slot for weight arbitration. Measurement unit: AHB bus clock
 *  cycle.
 */
#define AHB_DMA_ARB_TIMEOUT    0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_M  (AHB_DMA_ARB_TIMEOUT_V << AHB_DMA_ARB_TIMEOUT_S)
#define AHB_DMA_ARB_TIMEOUT_V  0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_S  0

/** AHB_DMA_WEIGHT_EN_REG register
 *  Weight arbitration enable register
 */
#define AHB_DMA_WEIGHT_EN_REG (DR_REG_AHB_DMA_BASE + 0x400)
/** AHB_DMA_WEIGHT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_WEIGHT_EN    (BIT(0))
#define AHB_DMA_WEIGHT_EN_M  (AHB_DMA_WEIGHT_EN_V << AHB_DMA_WEIGHT_EN_S)
#define AHB_DMA_WEIGHT_EN_V  0x00000001U
#define AHB_DMA_WEIGHT_EN_S  0

/** AHB_DMA_MODULE_CLK_EN_REG register
 *  Force clock enable register for all internal GDMA modules
 */
#define AHB_DMA_MODULE_CLK_EN_REG (DR_REG_AHB_DMA_BASE + 0x404)
/** AHB_DMA_AHB_APB_SYNC_CLK_EN : R/W; bitpos: [1:0]; default: 3;
 *  Configures whether to force enable the clock for the GDMA register configuration
 *  synchronization module.
 *  Bit 0 corresponds to TX and RX channel 0, bit 1 corresponds to TX and RX channel 1,
 *  and so on.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_AHB_APB_SYNC_CLK_EN    0x00000003U
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_M  (AHB_DMA_AHB_APB_SYNC_CLK_EN_V << AHB_DMA_AHB_APB_SYNC_CLK_EN_S)
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_V  0x00000003U
#define AHB_DMA_AHB_APB_SYNC_CLK_EN_S  0
/** AHB_DMA_OUT_DSCR_CLK_EN : R/W; bitpos: [3:2]; default: 7;
 *  Configures whether to force enable the clock for the GDMA TX descriptor processing
 *  module.
 *  Bit 0 corresponds to TX channel 0, bit 1 corresponds to TX channel 1, and so on.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_OUT_DSCR_CLK_EN    0x00000003U
#define AHB_DMA_OUT_DSCR_CLK_EN_M  (AHB_DMA_OUT_DSCR_CLK_EN_V << AHB_DMA_OUT_DSCR_CLK_EN_S)
#define AHB_DMA_OUT_DSCR_CLK_EN_V  0x00000003U
#define AHB_DMA_OUT_DSCR_CLK_EN_S  2
/** AHB_DMA_OUT_CTRL_CLK_EN : R/W; bitpos: [5:4]; default: 7;
 *  Configures whether to force enable the clock for the GDMA TX data processing module.
 *  Bit 0 corresponds to TX channel 0, bit 1 corresponds to TX channel 1, and so on.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_OUT_CTRL_CLK_EN    0x00000003U
#define AHB_DMA_OUT_CTRL_CLK_EN_M  (AHB_DMA_OUT_CTRL_CLK_EN_V << AHB_DMA_OUT_CTRL_CLK_EN_S)
#define AHB_DMA_OUT_CTRL_CLK_EN_V  0x00000003U
#define AHB_DMA_OUT_CTRL_CLK_EN_S  4
/** AHB_DMA_IN_DSCR_CLK_EN : R/W; bitpos: [7:6]; default: 7;
 *  Configures whether to force enable the clock for the GDMA RX descriptor processing
 *  module.
 *  Bit 0 corresponds to RX channel 0, bit 1 corresponds to RX channel 1, and so on.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_IN_DSCR_CLK_EN    0x00000003U
#define AHB_DMA_IN_DSCR_CLK_EN_M  (AHB_DMA_IN_DSCR_CLK_EN_V << AHB_DMA_IN_DSCR_CLK_EN_S)
#define AHB_DMA_IN_DSCR_CLK_EN_V  0x00000003U
#define AHB_DMA_IN_DSCR_CLK_EN_S  6
/** AHB_DMA_IN_CTRL_CLK_EN : R/W; bitpos: [9:8]; default: 7;
 *  Configures whether to force enable the clock for the GDMA RX data processing module.
 *  Bit 0 corresponds to RX channel 0, bit 1 corresponds to RX channel 1, and so on.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_IN_CTRL_CLK_EN    0x00000003U
#define AHB_DMA_IN_CTRL_CLK_EN_M  (AHB_DMA_IN_CTRL_CLK_EN_V << AHB_DMA_IN_CTRL_CLK_EN_S)
#define AHB_DMA_IN_CTRL_CLK_EN_V  0x00000003U
#define AHB_DMA_IN_CTRL_CLK_EN_S  8
/** AHB_DMA_CMD_ARB_CLK_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether to force enable the clock for the GDMA arbiter module.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_CMD_ARB_CLK_EN    (BIT(27))
#define AHB_DMA_CMD_ARB_CLK_EN_M  (AHB_DMA_CMD_ARB_CLK_EN_V << AHB_DMA_CMD_ARB_CLK_EN_S)
#define AHB_DMA_CMD_ARB_CLK_EN_V  0x00000001U
#define AHB_DMA_CMD_ARB_CLK_EN_S  27
/** AHB_DMA_AHBINF_CLK_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether to force enable the clock for the GDMA bus interface processing
 *  module.
 *  0: Not forced to enable
 *  1: Forced to enable
 */
#define AHB_DMA_AHBINF_CLK_EN    (BIT(28))
#define AHB_DMA_AHBINF_CLK_EN_M  (AHB_DMA_AHBINF_CLK_EN_V << AHB_DMA_AHBINF_CLK_EN_S)
#define AHB_DMA_AHBINF_CLK_EN_V  0x00000001U
#define AHB_DMA_AHBINF_CLK_EN_S  28

/** AHB_DMA_AHBINF_RESP_ERR_STATUS0_REG register
 *  AHB bus error response status register 0
 */
#define AHB_DMA_AHBINF_RESP_ERR_STATUS0_REG (DR_REG_AHB_DMA_BASE + 0x408)
/** AHB_DMA_AHBINF_RESP_ERR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current AHB bus transfer that triggers an error
 *  response.
 */
#define AHB_DMA_AHBINF_RESP_ERR_ADDR    0xFFFFFFFFU
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_M  (AHB_DMA_AHBINF_RESP_ERR_ADDR_V << AHB_DMA_AHBINF_RESP_ERR_ADDR_S)
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_AHBINF_RESP_ERR_ADDR_S  0

/** AHB_DMA_AHBINF_RESP_ERR_STATUS1_REG register
 *  AHB bus error response status register 1
 */
#define AHB_DMA_AHBINF_RESP_ERR_STATUS1_REG (DR_REG_AHB_DMA_BASE + 0x40c)
/** AHB_DMA_AHBINF_RESP_ERR_WR : RO; bitpos: [0]; default: 0;
 *  Represents the type of the transfer that triggered the AHB bus error response
 *  received by the GDMA.
 *  0: Read
 *  1: Write
 */
#define AHB_DMA_AHBINF_RESP_ERR_WR    (BIT(0))
#define AHB_DMA_AHBINF_RESP_ERR_WR_M  (AHB_DMA_AHBINF_RESP_ERR_WR_V << AHB_DMA_AHBINF_RESP_ERR_WR_S)
#define AHB_DMA_AHBINF_RESP_ERR_WR_V  0x00000001U
#define AHB_DMA_AHBINF_RESP_ERR_WR_S  0
/** AHB_DMA_AHBINF_RESP_ERR_ID : RO; bitpos: [4:1]; default: 15;
 *  Represents the ID of the transfer that triggers the AHB bus error response.
 *  0: Reserved
 *  1: Transfer between GP-SPI2 and memory
 *  2: Reserved
 *  3: Reserved
 *  4: Transfer between Audio Sample Rate Converter and memory
 *  5: Reserved
 *  6: Reserved
 *  7: Transfer between SHA and memory
 *  8: Transfer between ADC and memory
 *  9: Reserved
 *  10: Memory-to-memory transfer on channel 0
 *  11: Memory-to-memory transfer on channel 1
 *  12: Reserved
 *  13: Reserved
 *  14: Reserved
 *  15: Invalid
 */
#define AHB_DMA_AHBINF_RESP_ERR_ID    0x0000000FU
#define AHB_DMA_AHBINF_RESP_ERR_ID_M  (AHB_DMA_AHBINF_RESP_ERR_ID_V << AHB_DMA_AHBINF_RESP_ERR_ID_S)
#define AHB_DMA_AHBINF_RESP_ERR_ID_V  0x0000000FU
#define AHB_DMA_AHBINF_RESP_ERR_ID_S  1
/** AHB_DMA_AHBINF_RESP_ERR_CH_ID : RO; bitpos: [6:5]; default: 0;
 *  Represents the channel ID of the transfer that triggers the AHB bus error response.
 *  Bit[0]: Channel number. Value range: 0 ~ 1
 *  Bit[1]: Channel direction.
 *  0: RX
 *  1: TX
 */
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID    0x00000003U
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_M  (AHB_DMA_AHBINF_RESP_ERR_CH_ID_V << AHB_DMA_AHBINF_RESP_ERR_CH_ID_S)
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_V  0x00000003U
#define AHB_DMA_AHBINF_RESP_ERR_CH_ID_S  5

#ifdef __cplusplus
}
#endif
